server/artillery.yml
config:
  target: "http://localhost:3000/chat"
  engines:
    socketio: {}

  phases:
    - duration: 60       # total test duration (4 minutes)
      arrivalRate: 5
      maxVusers: 60

scenarios:
  - name: chat-user
    engine: socketio
    flow:
      # Each user sends multiple messages over their lifetime
      - loop:
          - think: 1
          - emit:
              channel: "send-message"
              data:
                text: "When she didnt like a guy who was trying to pick her up, she started using sign language."
          - think: 2
          - emit:
              channel: "send-message"
              data:
                text: "Hows it going?"
          - think: 1
          - emit:
              channel: "send-message"
              data:
                text: "I ate a sock because people on the Internet told me to."
          - think: 3
          - emit:
              channel: "send-message"
              data:
                text: "There's a reason that roses have thorns"
          - think: 2
          - emit:
              channel: "send-message"
              data:
                text: "Lol, thats funny"
        count: 20   # 20× this loop → ~100 messages per user